python/python-lib-pytorch.org
#+TITLE: PyTorch
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2020-10-12 Mon 10:48:59>
#+HTML_LINK_UP: ../readme.html
#+HTML_LINK_HOME: ../index.html
#+SETUPFILE: ~/.emacs.d/site-lisp/org-html-themes/setup/theme-readtheorg-local.setup
#+TAGS: pytorch torch python cnn


* PyTorch
  PyTorch 和 Numpy 的数组和相似，PyTorch 的数据类型大多数是叫 Tensor，并且 Tensor
  可以在 GPU 上进行计算，用于提高计算效率

  #+BEGIN_SRC python :session cpython :exports both :results none
    import torch
    import torch.nn as nn
    import torch.nn.functional as F

    import torchvision
    import torchvision.transforms as transforms

    import numpy as np

    torch.set_printoptions(linewidth=200)
  #+END_SRC

* 基础运算
** 初始化、数据类型
   #+BEGIN_SRC python :session cpython :exports both :results output
     x0 = torch.zeros(2, 3)
     x1 = torch.ones(3, 2)
     x2 = torch.zeros(2, 3, dtype=torch.long) # dtype: int32 int64 float32 float64
     x3 = torch.tensor([1.1, 3.0])
     print(x1)
     print(x2)
     print(x3)
   #+END_SRC

   #+RESULTS:
   : tensor([[1., 1.],
   :         [1., 1.],
   :         [1., 1.]])
   : tensor([[0, 0, 0],
   :         [0, 0, 0]])
   : tensor([1.1000, 3.0000])

   获取默认创建的数据类型
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     print(torch.get_default_dtype())
   #+END_SRC

   #+RESULTS:
   : torch.float32

** 获取形状
   获取 Tensor 的形状和元素数量
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     x1 = torch.tensor([1.1, 3.0])
     print(x1.size())
     print(x1.numel()) # number of elements

     x2 = torch.tensor([[1.1, 3.0, 3.3], [3, 4, 5]])
     print(x2.size())
     print(x2.numel())
   #+END_SRC

   #+RESULTS:
   : torch.Size([2])
   : 2
   : torch.Size([2, 3])
   : 6

** Tensor 和 ndarray 数据类型互转
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     t1 = torch.randn((2, 3)) # normal distribution with shape (2,3)
     a1 = t1.numpy()
     print(t1)
     print(a1)

     a2 = np.random.normal(0, 0.01, 6)
     t2 = torch.from_numpy(a2)
     print(a2)
     print(t2)
   #+END_SRC

   #+RESULTS:
   : tensor([[-0.0652, -0.3537,  1.3550],
   :         [-0.6979, -0.7713, -0.5261]])
   : [[-0.0652356  -0.35367048  1.3549587 ]
   :  [-0.6978578  -0.7712709  -0.5261264 ]]
   : [-0.0092347  -0.00012146 -0.00581832 -0.00620685 -0.00119326 -0.00189925]
   : tensor([-0.0092, -0.0001, -0.0058, -0.0062, -0.0012, -0.0019], dtype=torch.float64)

   PyTorch 和 Numpy 数据关系包含两种关系：share vs. copy
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     a = np.array([1, 2, 3])
     print(a)

     t1 = torch.Tensor(a)
     t2 = torch.tensor(a)
     t3 = torch.as_tensor(a)
     t4 = torch.from_numpy(a)

     a[0] = 0
     a[1] = 0
     print(t1)
     print(t2)
     print(t3)
     print(t4)
   #+END_SRC

   #+RESULTS:
   : [1 2 3]
   : tensor([1., 2., 3.])
   : tensor([1, 2, 3])
   : tensor([0, 0, 3])
   : tensor([0, 0, 3])

* 形状变换
