python/python-lib-pytorch.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-01 Sun 10:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PyTorch</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">PyTorch</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd4aad3f">1. PyTorch</a></li>
<li><a href="#orgb338fd3">2. 基础运算</a>
<ul>
<li><a href="#orgc947528">2.1. 初始化、数据类型</a></li>
<li><a href="#org78c50f5">2.2. 获取形状</a></li>
<li><a href="#orgd0a59ac">2.3. Tensor 和 ndarray 数据类型互转</a></li>
</ul>
</li>
<li><a href="#org13a9f3a">3. 形状变换</a>
<ul>
<li><a href="#org9fe92c9">3.1. 变形</a></li>
<li><a href="#orga5854f9">3.2. 拼接</a></li>
</ul>
</li>
<li><a href="#orgb4fc84a">4. CUDA 技术</a></li>
<li><a href="#orgdcea205">5. 定义模型</a>
<ul>
<li><a href="#org1f9e6c0">5.1. 实验代码</a></li>
</ul>
</li>
<li><a href="#orgff233a4">6. 附录</a></li>
<li><a href="#orgade9926">7. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgd4aad3f" class="outline-2">
<h2 id="orgd4aad3f"><span class="section-number-2">1</span> PyTorch</h2>
<div class="outline-text-2" id="text-1">
<p>
PyTorch 和 Numpy 的数组和相似，PyTorch 的数据类型大多数是叫 Tensor，并且 Tensor
可以在 GPU 上进行计算，用于提高计算效率
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b9ca4a;">import</span> torch
<span style="color: #b9ca4a;">import</span> torch.nn <span style="color: #b9ca4a;">as</span> nn
<span style="color: #b9ca4a;">import</span> torch.nn.functional <span style="color: #b9ca4a;">as</span> F

<span style="color: #b9ca4a;">import</span> torchvision
<span style="color: #b9ca4a;">import</span> torchvision.transforms <span style="color: #b9ca4a;">as</span> transforms

<span style="color: #b9ca4a;">import</span> numpy <span style="color: #b9ca4a;">as</span> np

torch.set_printoptions<span style="color: #8d5649;">(</span>linewidth=200<span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb338fd3" class="outline-2">
<h2 id="orgb338fd3"><span class="section-number-2">2</span> 基础运算</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc947528" class="outline-3">
<h3 id="orgc947528"><span class="section-number-3">2.1</span> 初始化、数据类型</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">x0</span> = torch.zeros<span style="color: #8d5649;">(</span>2, 3<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">x1</span> = torch.ones<span style="color: #8d5649;">(</span>3, 2<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">x2</span> = torch.zeros<span style="color: #8d5649;">(</span>2, 3, dtype=torch.<span style="color: #c397d8;">long</span><span style="color: #8d5649;">)</span> <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">dtype: int32 int64 float32 float64</span>
<span style="color: #e7c547;">x3</span> = torch.tensor<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>1.1, 3.0<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x1<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x2<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x3<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
tensor([[1., 1.],
        [1., 1.],
        [1., 1.]])
tensor([[0, 0, 0],
        [0, 0, 0]])
tensor([1.1000, 3.0000])

</pre>

<p>
获取默认创建的数据类型
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>torch.get_default_dtype<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
torch.float32

</pre>
</div>
</div>

<div id="outline-container-org78c50f5" class="outline-3">
<h3 id="org78c50f5"><span class="section-number-3">2.2</span> 获取形状</h3>
<div class="outline-text-3" id="text-2-2">
<p>
获取 Tensor 的形状和元素数量
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">x1</span> = torch.tensor<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>1.1, 3.0<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x1.size<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x1.numel<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span> <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">number of elements</span>

<span style="color: #e7c547;">x2</span> = torch.tensor<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>1.1, 3.0, 3.3<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>3, 4, 5<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x2.size<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x2.numel<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
torch.Size([2])
2
torch.Size([2, 3])
6

</pre>
</div>
</div>

<div id="outline-container-orgd0a59ac" class="outline-3">
<h3 id="orgd0a59ac"><span class="section-number-3">2.3</span> Tensor 和 ndarray 数据类型互转</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">t1</span> = torch.randn<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>2, 3<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span> <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">normal distribution with shape (2,3)</span>
<span style="color: #e7c547;">a1</span> = t1.numpy<span style="color: #8d5649;">()</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>t1<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a1<span style="color: #8d5649;">)</span>

<span style="color: #e7c547;">a2</span> = np.random.normal<span style="color: #8d5649;">(</span>0, 0.01, 6<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">t2</span> = torch.from_numpy<span style="color: #8d5649;">(</span>a2<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a2<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>t2<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
tensor([[-0.0652, -0.3537,  1.3550],
        [-0.6979, -0.7713, -0.5261]])
[[-0.0652356  -0.35367048  1.3549587 ]
 [-0.6978578  -0.7712709  -0.5261264 ]]
[-0.0092347  -0.00012146 -0.00581832 -0.00620685 -0.00119326 -0.00189925]
tensor([-0.0092, -0.0001, -0.0058, -0.0062, -0.0012, -0.0019], dtype=torch.float64)

</pre>

<p>
PyTorch 和 Numpy 数据关系包含两种关系：share vs. copy
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">a</span> = np.array<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>1, 2, 3<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a<span style="color: #8d5649;">)</span>

<span style="color: #e7c547;">t1</span> = torch.Tensor<span style="color: #8d5649;">(</span>a<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">t2</span> = torch.tensor<span style="color: #8d5649;">(</span>a<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">t3</span> = torch.as_tensor<span style="color: #8d5649;">(</span>a<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">t4</span> = torch.from_numpy<span style="color: #8d5649;">(</span>a<span style="color: #8d5649;">)</span>

<span style="color: #e7c547;">a</span><span style="color: #8d5649;">[</span>0<span style="color: #8d5649;">]</span> = 0
<span style="color: #e7c547;">a</span><span style="color: #8d5649;">[</span>1<span style="color: #8d5649;">]</span> = 0
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>t1<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>t2<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>t3<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>t4<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
[1 2 3]
tensor([1., 2., 3.])
tensor([1, 2, 3])
tensor([0, 0, 3])
tensor([0, 0, 3])

</pre>
</div>
</div>
</div>
