python/python-lib-pytorch.org
** 变形
   如果想要 resize 或 reshape 一个 tensor，可以使用 view 方法。如果需要 copy，用
   clone, 如果需要源数据，用 view, reshape 这玩意不好控制，则没那么可控，他的执
   行结果可能是源数据的一个 copy，也可能不是，最好少用
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     x1 = torch.randn(24)
     x2 = x1.view(2, 3, 4)
     x3 = x1.view(4, -1)
     print(x2)
     print(x3)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   tensor([[[-0.0513,  1.5727,  1.4737,  0.3913],
            [ 2.2639,  0.4963,  0.3401, -0.2731],
            [-1.4023,  1.7182,  0.9297,  0.1243]],

           [[-0.4909, -0.5568,  1.9808,  0.7490],
            [ 0.1885,  0.4245,  0.0027, -0.8911],
            [-0.7410,  1.0522, -0.8816, -2.5483]]])
   tensor([[-0.0513,  1.5727,  1.4737,  0.3913,  2.2639,  0.4963],
           [ 0.3401, -0.2731, -1.4023,  1.7182,  0.9297,  0.1243],
           [-0.4909, -0.5568,  1.9808,  0.7490,  0.1885,  0.4245],
           [ 0.0027, -0.8911, -0.7410,  1.0522, -0.8816, -2.5483]])
   #+end_example

   如果 tensor 里只有一个数字，item 方法可以把里面的 value 变成 Python 数值
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     x = torch.randn(1)
     print(x)
     print(x.item())
   #+END_SRC

   #+RESULTS:
   : tensor([-0.4755])
   : -0.47550874948501587

   修改矩阵的形状，转置，交换维度等操作
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     x = torch.arange(12).view(2, 3, 2)
     print(x)
     print(x.transpose(1, 0))
     print(x.permute(1, 0, 2))
   #+END_SRC

   #+RESULTS:
   #+begin_example
   tensor([[[ 0,  1],
            [ 2,  3],
            [ 4,  5]],

           [[ 6,  7],
            [ 8,  9],
            [10, 11]]])
   tensor([[[ 0,  1],
            [ 6,  7]],

           [[ 2,  3],
            [ 8,  9]],

           [[ 4,  5],
            [10, 11]]])
   tensor([[[ 0,  1],
            [ 6,  7]],

           [[ 2,  3],
            [ 8,  9]],

           [[ 4,  5],
            [10, 11]]])
   #+end_example

   压扁给定的维度为 1  的维度值
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     x = torch.arange(6).view(1, -1)
     print(x.shape)
     print(x)
     a1 = x.squeeze(0)
     print(a1.shape)
     print(a1)
     a2 = a1.unsqueeze(0)
     print(a2)
   #+END_SRC

   #+RESULTS:
   : torch.Size([1, 6])
   : tensor([[0, 1, 2, 3, 4, 5]])
   : torch.Size([6])
   : tensor([0, 1, 2, 3, 4, 5])
   : tensor([[0, 1, 2, 3, 4, 5]])

   定义一个 flatten 函数，将输入数据扁平化
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     def flatten(t):
         t = t.view(1, -1)
         t = t.squeeze()
         return t

     x1 = torch.tensor([1, 2, 3, 4, 5, 6], dtype=torch.float32).reshape(2, 3)
     print(x1)
     print(flatten(x1))
   #+END_SRC

   #+RESULTS:
   : tensor([[1., 2., 3.],
   :         [4., 5., 6.]])
   : tensor([1., 2., 3., 4., 5., 6.])

** 拼接
   将多个张量合并拼接成一个向量
   #+BEGIN_SRC python :session cpython :exports both :results output pp
     t1 = torch.tensor([[1, 2], [3, 4]])
     t2 = torch.tensor([[5, 6], [7, 8]])

     x1 = torch.cat((t1, t2), dim=0)
     print(x1)
     x2 = torch.cat((t1, t2), dim=1)
     print(x2)
   #+END_SRC

   #+RESULTS:
   : tensor([[1, 2],
   :         [3, 4],
   :         [5, 6],
   :         [7, 8]])
   : tensor([[1, 2, 5, 6],
   :         [3, 4, 7, 8]])

* CUDA 技术
  Tensor 可以放在 CUDA 显卡上进行计算
  #+BEGIN_SRC python :session cpython :exports both :results output pp
    x = torch.randn(2, 3)
    if torch.cuda.is_available():
        device = torch.device("cuda:0")  # a CUDA device object
        y = torch.ones_like(x, device=device)  # directly create a tensor on GPU
        x = x.to(device)  # or just use strings ``.to("cuda")``
        z = x + y
        print(z)
        print(z.to("cpu", torch.double))  # ``.to`` can also change dtype together!
    else:
        print("gpu is not available")
  #+END_SRC

  #+RESULTS:
  : gpu is not available

