python/python-lib-pytorch.html

<div id="outline-container-org13a9f3a" class="outline-2">
<h2 id="org13a9f3a"><span class="section-number-2">3</span> 形状变换</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9fe92c9" class="outline-3">
<h3 id="org9fe92c9"><span class="section-number-3">3.1</span> 变形</h3>
<div class="outline-text-3" id="text-3-1">
<p>
如果想要 resize 或 reshape 一个 tensor，可以使用 view 方法。如果需要 copy，用
clone, 如果需要源数据，用 view, reshape 这玩意不好控制，则没那么可控，他的执
行结果可能是源数据的一个 copy，也可能不是，最好少用
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">x1</span> = torch.randn<span style="color: #8d5649;">(</span>24<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">x2</span> = x1.view<span style="color: #8d5649;">(</span>2, 3, 4<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">x3</span> = x1.view<span style="color: #8d5649;">(</span>4, -1<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x2<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x3<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
tensor([[[-0.0513,  1.5727,  1.4737,  0.3913],
         [ 2.2639,  0.4963,  0.3401, -0.2731],
         [-1.4023,  1.7182,  0.9297,  0.1243]],

        [[-0.4909, -0.5568,  1.9808,  0.7490],
         [ 0.1885,  0.4245,  0.0027, -0.8911],
         [-0.7410,  1.0522, -0.8816, -2.5483]]])
tensor([[-0.0513,  1.5727,  1.4737,  0.3913,  2.2639,  0.4963],
        [ 0.3401, -0.2731, -1.4023,  1.7182,  0.9297,  0.1243],
        [-0.4909, -0.5568,  1.9808,  0.7490,  0.1885,  0.4245],
        [ 0.0027, -0.8911, -0.7410,  1.0522, -0.8816, -2.5483]])
</pre>

<p>
如果 tensor 里只有一个数字，item 方法可以把里面的 value 变成 Python 数值
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">x</span> = torch.randn<span style="color: #8d5649;">(</span>1<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x.item<span style="color: #d8241f;">()</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
tensor([-0.4755])
-0.47550874948501587

</pre>

<p>
修改矩阵的形状，转置，交换维度等操作
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">x</span> = torch.arange<span style="color: #8d5649;">(</span>12<span style="color: #8d5649;">)</span>.view<span style="color: #8d5649;">(</span>2, 3, 2<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x.transpose<span style="color: #d8241f;">(</span>1, 0<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x.permute<span style="color: #d8241f;">(</span>1, 0, 2<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
tensor([[[ 0,  1],
         [ 2,  3],
         [ 4,  5]],

        [[ 6,  7],
         [ 8,  9],
         [10, 11]]])
tensor([[[ 0,  1],
         [ 6,  7]],

        [[ 2,  3],
         [ 8,  9]],

        [[ 4,  5],
         [10, 11]]])
tensor([[[ 0,  1],
         [ 6,  7]],

        [[ 2,  3],
         [ 8,  9]],

        [[ 4,  5],
         [10, 11]]])
</pre>

<p>
压扁给定的维度为 1  的维度值
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">x</span> = torch.arange<span style="color: #8d5649;">(</span>6<span style="color: #8d5649;">)</span>.view<span style="color: #8d5649;">(</span>1, -1<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x.shape<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">a1</span> = x.squeeze<span style="color: #8d5649;">(</span>0<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a1.shape<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a1<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">a2</span> = a1.unsqueeze<span style="color: #8d5649;">(</span>0<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>a2<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
torch.Size([1, 6])
tensor([[0, 1, 2, 3, 4, 5]])
torch.Size([6])
tensor([0, 1, 2, 3, 4, 5])
tensor([[0, 1, 2, 3, 4, 5]])

</pre>

<p>
定义一个 flatten 函数，将输入数据扁平化
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b9ca4a;">def</span> <span style="color: #e78c45;">flatten</span><span style="color: #8d5649;">(</span>t<span style="color: #8d5649;">)</span>:
    <span style="color: #e7c547;">t</span> = t.view<span style="color: #8d5649;">(</span>1, -1<span style="color: #8d5649;">)</span>
    <span style="color: #e7c547;">t</span> = t.squeeze<span style="color: #8d5649;">()</span>
    <span style="color: #b9ca4a;">return</span> t

<span style="color: #e7c547;">x1</span> = torch.tensor<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>1, 2, 3, 4, 5, 6<span style="color: #d8241f;">]</span>, dtype=torch.float32<span style="color: #8d5649;">)</span>.reshape<span style="color: #8d5649;">(</span>2, 3<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x1<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>flatten<span style="color: #d8241f;">(</span>x1<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
tensor([[1., 2., 3.],
        [4., 5., 6.]])
tensor([1., 2., 3., 4., 5., 6.])

</pre>
</div>
</div>

<div id="outline-container-orga5854f9" class="outline-3">
<h3 id="orga5854f9"><span class="section-number-3">3.2</span> 拼接</h3>
<div class="outline-text-3" id="text-3-2">
<p>
将多个张量合并拼接成一个向量
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">t1</span> = torch.tensor<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>1, 2<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>3, 4<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">t2</span> = torch.tensor<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span><span style="color: #9564bf;">[</span>5, 6<span style="color: #9564bf;">]</span>, <span style="color: #9564bf;">[</span>7, 8<span style="color: #9564bf;">]</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>

<span style="color: #e7c547;">x1</span> = torch.cat<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>t1, t2<span style="color: #d8241f;">)</span>, dim=0<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x1<span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">x2</span> = torch.cat<span style="color: #8d5649;">(</span><span style="color: #d8241f;">(</span>t1, t2<span style="color: #d8241f;">)</span>, dim=1<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>x2<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
tensor([[1, 2],
        [3, 4],
        [5, 6],
        [7, 8]])
tensor([[1, 2, 5, 6],
        [3, 4, 7, 8]])

</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4fc84a" class="outline-2">
<h2 id="orgb4fc84a"><span class="section-number-2">4</span> CUDA 技术</h2>
<div class="outline-text-2" id="text-4">
<p>
Tensor 可以放在 CUDA 显卡上进行计算
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e7c547;">x</span> = torch.randn<span style="color: #8d5649;">(</span>2, 3<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">if</span> torch.cuda.is_available<span style="color: #8d5649;">()</span>:
    <span style="color: #e7c547;">device</span> = torch.device<span style="color: #8d5649;">(</span><span style="color: #70c0b1;">"cuda:0"</span><span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">a CUDA device object</span>
    <span style="color: #e7c547;">y</span> = torch.ones_like<span style="color: #8d5649;">(</span>x, device=device<span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">directly create a tensor on GPU</span>
    <span style="color: #e7c547;">x</span> = x.to<span style="color: #8d5649;">(</span>device<span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">or just use strings ``.to("cuda")``</span>
    <span style="color: #e7c547;">z</span> = x + y
    <span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>z<span style="color: #8d5649;">)</span>
    <span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>z.to<span style="color: #d8241f;">(</span><span style="color: #70c0b1;">"cpu"</span>, torch.double<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>  <span style="color: #969896; font-style: italic;"># </span><span style="color: #969896; font-style: italic;">``.to`` can also change dtype together!</span>
<span style="color: #b9ca4a;">else</span>:
    <span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span><span style="color: #70c0b1;">"gpu is not available"</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
gpu is not available

</pre>
</div>
</div>
