python/python-lib-pytorch.html

<div id="outline-container-orgdcea205" class="outline-2">
<h2 id="orgdcea205"><span class="section-number-2">5</span> 定义模型</h2>
<div class="outline-text-2" id="text-5">
<p>
PyTorch 构造模型时主要包含两个步骤：
</p>
<ol class="org-ol">
<li>继承 <code>nn.Module</code> 类</li>
<li>实现 <code>forward()</code> 方法</li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b9ca4a;">import</span> torch
<span style="color: #b9ca4a;">import</span> torch.nn <span style="color: #b9ca4a;">as</span> nn


<span style="color: #b9ca4a;">class</span> <span style="color: #7aa6da;">Network</span><span style="color: #8d5649;">(</span>nn.Module<span style="color: #8d5649;">)</span>:
    <span style="color: #b9ca4a;">def</span> <span style="color: #e78c45;">__init__</span><span style="color: #8d5649;">(</span><span style="color: #b9ca4a;">self</span><span style="color: #8d5649;">)</span>:
        <span style="color: #c397d8;">super</span><span style="color: #8d5649;">(</span>Network, <span style="color: #b9ca4a;">self</span><span style="color: #8d5649;">)</span>.__init__<span style="color: #8d5649;">()</span>

    <span style="color: #b9ca4a;">def</span> <span style="color: #e78c45;">forward</span><span style="color: #8d5649;">(</span><span style="color: #b9ca4a;">self</span>, in_data<span style="color: #8d5649;">)</span>:
        <span style="color: #e7c547;">out_data</span> = in_data
        <span style="color: #b9ca4a;">return</span> out_data
</pre>
</div>
</div>

<div id="outline-container-org1f9e6c0" class="outline-3">
<h3 id="org1f9e6c0"><span class="section-number-3">5.1</span> 实验代码</h3>
<div class="outline-text-3" id="text-5-1">
<p>
完整的定义网络模型的代码参考如下代码
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #b9ca4a;">import</span> torch
<span style="color: #b9ca4a;">import</span> torch.nn <span style="color: #b9ca4a;">as</span> nn
<span style="color: #b9ca4a;">import</span> torch.nn.functional <span style="color: #b9ca4a;">as</span> F

<span style="color: #b9ca4a;">import</span> torchvision
<span style="color: #b9ca4a;">import</span> torchvision.transforms <span style="color: #b9ca4a;">as</span> transforms

torch.set_printoptions<span style="color: #8d5649;">(</span>linewidth=200<span style="color: #8d5649;">)</span>

<span style="color: #b9ca4a;">class</span> <span style="color: #7aa6da;">Network</span><span style="color: #8d5649;">(</span>nn.Module<span style="color: #8d5649;">)</span>:
  <span style="color: #b9ca4a;">def</span> <span style="color: #e78c45;">__init__</span><span style="color: #8d5649;">(</span><span style="color: #b9ca4a;">self</span><span style="color: #8d5649;">)</span>:
    <span style="color: #c397d8;">super</span><span style="color: #8d5649;">()</span>.__init__<span style="color: #8d5649;">()</span>
    <span style="color: #b9ca4a;">self</span>.conv1 = nn.Conv2d<span style="color: #8d5649;">(</span>in_channels=1, out_channels=6, kernel_size=5<span style="color: #8d5649;">)</span>
    <span style="color: #b9ca4a;">self</span>.conv2 = nn.Conv2d<span style="color: #8d5649;">(</span>in_channels=6, out_channels=12, kernel_size=5<span style="color: #8d5649;">)</span>

    <span style="color: #b9ca4a;">self</span>.fc1 = nn.Linear<span style="color: #8d5649;">(</span>in_features=12 * 4 * 4, out_features=120<span style="color: #8d5649;">)</span>
    <span style="color: #b9ca4a;">self</span>.fc2 = nn.Linear<span style="color: #8d5649;">(</span>in_features=120, out_features=60<span style="color: #8d5649;">)</span>
    <span style="color: #b9ca4a;">self</span>.out = nn.Linear<span style="color: #8d5649;">(</span>in_features=60, out_features=10<span style="color: #8d5649;">)</span>

  <span style="color: #b9ca4a;">def</span> <span style="color: #e78c45;">forward</span><span style="color: #8d5649;">(</span><span style="color: #b9ca4a;">self</span>, t<span style="color: #8d5649;">)</span>:
    <span style="color: #e7c547;">t</span> = F.relu<span style="color: #8d5649;">(</span><span style="color: #b9ca4a;">self</span>.conv1<span style="color: #d8241f;">(</span>t<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
    <span style="color: #e7c547;">t</span> = F.max_pool2d<span style="color: #8d5649;">(</span>t, kernel_size=2, stride=2<span style="color: #8d5649;">)</span>

    <span style="color: #e7c547;">t</span> = F.relu<span style="color: #8d5649;">(</span><span style="color: #b9ca4a;">self</span>.conv2<span style="color: #d8241f;">(</span>t<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
    <span style="color: #e7c547;">t</span> = F.max_pool2d<span style="color: #8d5649;">(</span>t, kernel_size=2, stride=2<span style="color: #8d5649;">)</span>

    <span style="color: #e7c547;">t</span> = F.relu<span style="color: #8d5649;">(</span><span style="color: #b9ca4a;">self</span>.fc1<span style="color: #d8241f;">(</span>t.view<span style="color: #9564bf;">(</span>-1, 12 * 4 * 4<span style="color: #9564bf;">)</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
    <span style="color: #e7c547;">t</span> = F.relu<span style="color: #8d5649;">(</span><span style="color: #b9ca4a;">self</span>.fc2<span style="color: #d8241f;">(</span>t<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
    <span style="color: #e7c547;">t</span> = <span style="color: #b9ca4a;">self</span>.out<span style="color: #8d5649;">(</span>t<span style="color: #8d5649;">)</span>

    <span style="color: #b9ca4a;">return</span> t


<span style="color: #e7c547;">train_set</span> = torchvision.datasets.FashionMNIST<span style="color: #8d5649;">(</span>
  root=<span style="color: #70c0b1;">'./data'</span>,
  train=<span style="color: #7aa6da;">True</span>,
  download=<span style="color: #7aa6da;">True</span>,
  transform=transforms.Compose<span style="color: #d8241f;">(</span><span style="color: #9564bf;">[</span>transforms.ToTensor<span style="color: #24a222;">()</span><span style="color: #9564bf;">]</span><span style="color: #d8241f;">)</span>
<span style="color: #8d5649;">)</span>


<span style="color: #e7c547;">network</span> = Network<span style="color: #8d5649;">()</span>
<span style="color: #e7c547;">sample</span> = <span style="color: #c397d8;">next</span><span style="color: #8d5649;">(</span><span style="color: #c397d8;">iter</span><span style="color: #d8241f;">(</span>train_set<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #e7c547;">image</span>, <span style="color: #e7c547;">label</span> = sample

image.unsqueeze<span style="color: #8d5649;">(</span>0<span style="color: #8d5649;">)</span>.shape
<span style="color: #e7c547;">pred</span> = network<span style="color: #8d5649;">(</span>image.unsqueeze<span style="color: #d8241f;">(</span>0<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>pred<span style="color: #8d5649;">)</span>
<span style="color: #b9ca4a;">print</span><span style="color: #8d5649;">(</span>pred.argmax<span style="color: #d8241f;">(</span>dim=1<span style="color: #d8241f;">)</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
tensor([[ 0.0885,  0.1149,  0.0712,  0.0994, -0.0972,  0.0525, -0.0515,  0.0867,  0.1027,  0.0180]], grad_fn=&lt;AddmmBackward&gt;)
tensor([1])

</pre>
</div>
</div>
</div>

<div id="outline-container-orgff233a4" class="outline-2">
<h2 id="orgff233a4"><span class="section-number-2">6</span> 附录</h2>
<div class="outline-text-2" id="text-6">
<p>
安装 PyTorch 之前最好是配合 Anaconda3 发行版一起安装，安装好 Anaconda 过后直接
使用下面命令安装
</p>
<div class="org-src-container">
<pre class="src src-sh">conda install pytorch torchvision -c pytorch
</pre>
</div>

<p>
也可以使用 pip 安装对应的 wheel 包
</p>
<div class="org-src-container">
<pre class="src src-sh">pip3 install torch torchvision
</pre>
</div>
</div>
</div>

<div id="outline-container-orgade9926" class="outline-2">
<h2 id="orgade9926"><span class="section-number-2">7</span> 参考链接</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li><a href="https://pytorch.org/">PyTorch</a></li>
<li><a href="https://pytorch.org/docs/stable/index.html">PyTorch Doc</a></li>
<li><a href="https://mirrors.tuna.tsinghua.edu.cn/anaconda/archive/">Anaconda Download</a></li>
<li><a href="https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-python.html">org-mode python</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2020-11-01 Sun 10:50. Created by Jinghui Hu at 2020-10-12 Mon 10:48.</p>
</div>
</body>
</html>
